[UI_TREE]
EDITCfg=Изменить настройки
MARKCfg = Настройки маркировки
3DCfg = настройка 3D
ImportDxf_Type0Cfg=Настройки импорта DXF
SysCfg = Другие настройки

[править]
EDIT=Изменить настройки
PointFilterPrecis = точность точки фильтрации (мм)
PointFilterAngle = угол фильтра (градусы)
PointPrecisMoveStep = шаг перемещения точки (мм)
MICRO = шаг точной настройки положения (мм)
MICROROTATE = размер шага точной настройки угла (градусы)
CLICK = Точность захвата (мм)
ОТМЕНИТЬ = Количество этапов отката Количество этапов
ONETOTWO = Точность точки останова (мм)
ExtendSpace = точность масштабирования (мм)
KillAngleSpace = точность угла направляющей (мм)
PreViewZoomScale = масштабирование предварительного просмотра
LayerCnt = количество уровней
JoinDistance = максимальное расстояние слияния кривых
FastDrawEnable = строка заполнения показывает ускорение
FastDrawEnableOption=Off|Activate

[МАРКА]
MARK = Настройки маркировки
SafeDoorRemark = закрыта ли защитная дверь и следует ли продолжать маркировку
SafeDoorRemarkOption= Нет|Да
CloseRedIfMark = автоматически ли выключается красный свет при маркировке
CloseRedIfMarkOption = Нет|Да
RedPreviewLayerNo = скорость маркировки при предварительном просмотре красным светом

[3D]
3D = 3D настройки
3dModelPrecision = точность обработки 3D-модели
3dTrancePrecision = точность преобразования 3D-данных
STLOptimize=Оптимизация карты модели STL
STLOptimizeOption=Нет|Да

[ImportDxf_Type0]
ImportDxf_Type0=Настройки импорта DXF
SepArc = точность дуги (5 ~ 255)
SepSpLine = точность сплайна (5 ~ 255)

[Sys]
sys=Другие настройки
CIRCLEPRECIS = Точность дуги (мм)
SAMPLECOUNT = Количество выборок на отрезок дуги
AIIMPORTPRECIS=Точность импорта AI-файла (мм)
PowerFill = оптимизация скорости заполнения
PowerFillOption=Нет|Да
PowerDraw = оптимизация скорости рисования
PowerDrawOption=Нет|Да
PowerRPViewFrame = оптимизация границы предварительного просмотра красного света
PowerRPViewFrameOption=Нет|Да

[UI_FACE]
ExportSysPara = Параметр экспорта...
ImportSysPara = параметр импорта...
ОК = ОК
Cancel = Отмена
Apply =Применить

;3DCALI DLG MAIN 
[DLG 6000] 

1019 = Параметры маркировки 

1021 = Начало маркировки 

1022 = Красный свет 

1023 = циклическая маркировка 

1024 = Экспорт исправленных файлов 

1025 = Импорт исправленных файлов 

1027 = опорная точка двигателя 

1028 = Минимальная регулируемая позиция 

1029 = Максимальное регулируемое положение 

1030 = Корректировка рекурсивного приращения 

1031 = фокусное расстояние от базовой поверхности 

1033 = Параметры 

6000 = Тип коррекции 

6001 = Основные параметры 

6002 = Местоположение двигателя 

3 = Создание коррекционного файла 

4 = Сброс 



;3DCALI DLG PARAM 
[DLG 140] 

1035 = Количество маркировок 

1036 = скорость маркировки (mm / s) 

1037 = скорость пустого прыжка (mm / s) 

1038 = Q - частота (кГц) 

1039 = Q Освобождение (us) 

1040 = Электрический ток (A) 

1041 = мощность (%) 

1042 = Модель 

1051 = Применение 

2 = Отмена 

;3DCALI STRING
[STRINGTABLE]

Motor position = Позиция двигателя 

Current Focus = Текущее фокусное расстояние 

Wrong motor parameters = Ошибка параметров двигателя 

Motor Movement Failure = Моторный провал 

Motor increment out of range (0,01 мм ~ 5 мм) = превышение приращения двигателя (0,01 мм ~ 5 мм) 

Focus of base plane out of range (> 0 мм) = Фокусное расстояние над базой (> 0 мм) 

Ошибка Cali data, фокус должен быть монотонно увеличен / уменьшен = Ошибка данных, фокусное расстояние должно быть монотонно увеличено / уменьшено 

Файл вызова определен, и генерация изменит первоначальный файл.  Рекомендуется вернуться (экспортировать) к файлу на начальном этапе.  Вы уверены, что продолжаете генерировать?  Исправленный файл уже существует, и создание таблицы коррекции изменяет оригинальный исправленный файл, и рекомендуется, чтобы резервное копирование (экспорт) было создано позже.  Продолжается ли генерация? 

Generating cali file false: Unable to open / create file = Ошибка создания исправленного файла: не удалось открыть / создать файл 

Generating cali file false: Unable to write file = Ошибка создания исправленного файла 

Stop Marking = Остановить маркировку 

Start Marking = Начало работы 

Failed to Stop Marking = Неудача в остановке 

Failed to start marking = Остановить промах 

Экспорт успеха = Экспорт успеха 

Ошибка экспорта: Can not find cali file or copy file failed = Ошибка экспорта 

Import failed: Cali file does not exist = Ошибка импорта: исправленный файл не существует 

Import failed: Unknown = Ошибка импорта: Неизвестная ошибка 

Cali file уже существует, do you want to replace it = Исправленный файл существует, перезаписывается? 

Import success = Успешный импорт 

Import failed: Please manually copy the cali file to the '\ EMCC \ \ caliset \ \% cardID% \ \' directory = Ошибка импорта: скопируйте исправленный файл вручную в каталог '\ EMCC \ caliset \% cardID% \' 

Data is not enough, please input at lease 2 rows = Слишком мало данных, введите как минимум две строки данных 

Generation of cali file succeeded = Создание исправленного файла 

Error: Handle of device.dll is null = Ошибка: ручка device.dll пуста 

Ошибка: номер карты = ошибка 

Error: Load device.dll or API failed = Ошибка: Ошибка загрузки device.dll или его API 

Path of cali file wrong or SystemSet.ini not found = Исправление ошибок в каталоге файлов или SystemSet.ini 

Error: Open 3dmarker.dat failed = Ошибка: Ошибка открытия файла 3dmarker.dat 

Error: Open.dat failed = Ошибка: Ошибка открытия файла.dat 

Error: Enter mark environment failed = Ошибка: Не удалось войти в среду маркировки 

Error: Leave Mark Environment Failed = Ошибка: Ошибка выхода из среды маркировки 
